In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

1. Establish a connection between Python and the Sakila database.

In [ ]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

 2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [4]:
def rentals_month(engine:str,month:int,year:int)->pd.DataFrame:
    data = pd.read_sql_query(f'SELECT * , month(rental_date) AS rental_month, year(rental_date) AS rental_year FROM rental WHERE month(rental_date) = {month} AND year(rental_date) ={year}', engine)
    return data

In [5]:
data = rentals_month(engine,5,2005)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_month,rental_year
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,5,2005
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,5,2005
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,5,2005
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,5,2005
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5,2005

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

In [6]:
def rental_count_month(month:int, year:int) -> pd.DataFrame:
    df = rentals_month(engine,month,year)
    df2 = df.copy()
    df2 = pd.pivot_table(df2, index='customer_id', values='rental_id' ,aggfunc='count').reset_index()
    df2.columns = ['customer_id',f'rentals_{month}_{year}']
    return df2

In [7]:
rental_count_month(6,2005)

     customer_id  rentals_6_2005
0              1               7
1              2               1
2              3               4
3              4               6
4              5               5
..           ...             ...
585          595               2
586          596               2
587          597               3
588          598               1
589          599               4

[590 rows x 2 columns]

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [8]:
data1 = rental_count_month(6,2005)
data2 = rental_count_month(7,2005)

In [9]:
#data3 = pd.concat([data1,data2[data2.columns[-1]]],axis=1)
data3 = data1.merge(data2,how='outer', on='customer_id')
data3 = data3.fillna(0)

In [10]:
data3['diff']=abs(data3[data3.columns[-1]]-data3[data3.columns[-2]])

In [11]:
data3

     customer_id  rentals_6_2005  rentals_7_2005  diff
0              1             7.0              12   5.0
1              2             1.0              14  13.0
2              3             4.0              13   9.0
3              4             6.0               5   1.0
4              5             5.0              16  11.0
..           ...             ...             ...   ...
594          401             0.0               9   9.0
595          433             0.0              14  14.0
596          440             0.0              12  12.0
597          445             0.0              10  10.0
598          475             0.0              15  15.0

[599 rows x 4 columns]

I make an outer join because it can be that one customer make rantals in one date but on the other date he makes no rentals. First i tried a full join by set how='full' but it didnt work, contrary to Ignacio's slides.

In [12]:
def compare_rentals(month1:int, year1:int, month2:int, year2:int) -> pd.DataFrame:
    df1 = rental_count_month(month1,year1)
    df2 = rental_count_month(month2,year2)
    df3 = df1.merge(df2,how='outer', on='customer_id').fillna(0)
    df3['diff']=abs(df3[df3.columns[-1]]-df3[df3.columns[-2]])
    return df3

In [13]:
compare_rentals(5,2005,6,2005)

     customer_id  rentals_5_2005  rentals_6_2005  diff
0              1             2.0             7.0   5.0
1              2             1.0             1.0   0.0
2              3             2.0             4.0   2.0
3              5             3.0             5.0   2.0
4              6             3.0             4.0   1.0
..           ...             ...             ...   ...
593          583             0.0             6.0   6.0
594          585             0.0             4.0   4.0
595          591             0.0             3.0   3.0
596          592             0.0             5.0   5.0
597          598             0.0             1.0   1.0

[598 rows x 4 columns]